Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
module.authentik_system.data.kubernetes_service_v1.authentik_server: Reading...
module.authentik_system.data.kubernetes_service_v1.authentik_server: Read complete after 0s [id=authentik/authentik-server]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place

Terraform will perform the following actions:

  # module.omada_controller.kubernetes_stateful_set_v1.omada will be updated in-place
~ resource "kubernetes_stateful_set_v1" "omada" {
        id               = "omada-controller/omada-controller"
        # (1 unchanged attribute hidden)

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ volume_claim_template {
              ~ spec {
                    # (4 unchanged attributes hidden)

                  ~ resources {
                      ~ requests = {
                          ~ "storage" = "1Gi" -> "5Gi"
                        }
                        # (1 unchanged attribute hidden)
                    }
                }

                # (1 unchanged block hidden)
            }

            # (4 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.pihole_system.helm_release.pihole will be updated in-place
~ resource "helm_release" "pihole" {
      ~ id                         = "pihole" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "2025.08.0" -> (known after apply)
          ~ chart          = "pihole" -> (known after apply)
          ~ first_deployed = 1742521564 -> (known after apply)
          ~ last_deployed  = 1755564963 -> (known after apply)
          ~ name           = "pihole" -> (known after apply)
          ~ namespace      = "pihole-system" -> (known after apply)
          ~ notes          = <<-EOT
                Pi-hole Helm Chart Deployment
                
                1. Pi-hole Deployment Information:
                   - Release Name: pihole
                   - Namespace: pihole-system
                   - Chart Name: pihole
                   - Chart Version: 2.34.0
                
                2. Pi-hole Service Information:
                   - Service Name: pihole-web
                   - Service Type: ClusterIP
                   - Service Port: 80/443 TCP
                
                   - Service Name: pihole-dns-tcp
                   - Service Type: NodePort
                   - Service Port: 53 TCP
                
                   - Service Name: pihole-dns-udp
                   - Service Type: NodePort
                   - Service Port: 53 UDP
                
                   - Service Name: pihole-dhcp
                   - Service Type: NodePort
                   - Service Port: 67 UDP
                
                3. Accessing Pi-hole:
                   !!! This chart does not create a Loadbalancer for pihole by default. Please
                   create a configuration that is tailored to your setup. Especially the DNS
                   and DHCP services are system services that require a dedicated setup based
                   on your system !!!
                
                   Find more information in the wiki:
                   https://github.com/MoJo2600/pihole-kubernetes/wiki/Pi%E2%80%90hole
                
                4. Useful Commands:
                   - Check the Pi-hole Deployment Status:
                     helm status pihole
                
                   - Get Detailed Information about the Pi-hole Deployment:
                     helm get all pihole
                
                5. Clean Up:
                   - To uninstall/delete the Pi-hole deployment, run:
                     helm uninstall pihole
            EOT -> (known after apply)
          ~ revision       = 17 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - admin                 = {
                      - enabled = false
                    }
                  - dnsmasq               = {
                      - customSettings = [
                          - "except-interface=nonexisting",
                        ]
                    }
                  - doh                   = {
                      - enabled    = true
                      - envVars    = {
                          - DOH_UPSTREAM = "https://1.1.1.1/dns-query"
                        }
                      - pullPolicy = "IfNotPresent"
                    }
                  - image                 = {
                      - repository = "pihole/pihole"
                      - tag        = "2025.06.2"
                    }
                  - maxUnavailable        = 1
                  - persistentVolumeClaim = {
                      - enabled = false
                    }
                  - podDisruptionBudget   = {
                      - enabled      = true
                      - minAvailable = 1
                    }
                  - replicaCount          = 2
                  - serviceDhcp           = {
                      - enabled = false
                    }
                  - serviceDns            = {
                      - annotations = {
                          - "metallb.universe.tf/allow-shared-ip" = "pihole-svc"
                          - "metallb.universe.tf/loadBalancerIPs" = "10.206.101.1"
                        }
                      - type        = "LoadBalancer"
                    }
                  - serviceWeb            = {
                      - https = {
                          - enabled = false
                        }
                    }
                }
            ) -> (known after apply)
          ~ version        = "2.34.0" -> (known after apply)
        } -> (known after apply)
        name                       = "pihole"
      ~ version                    = "2.34.0" -> "2.35.0"
        # (27 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d .
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.billv.ca/lock?id=billv-ca%252Fhomelab-atlantis-k3s-base-services%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d .
  ```
Plan: 0 to add, 2 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```